000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ASSIGNMENTUNO.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060     SELECT IN-FILE
000070         ASSIGN        TO  "INFILE.TXT"
000080         ORGANIZATION IS LINE SEQUENTIAL.
000090     SELECT OUT-FILE
000100         ASSIGN        TO  "OUTFILE.TXT"
000110         ORGANIZATION IS SEQUENTIAL.
000120 DATA DIVISION.
000130 FILE SECTION.
000140 FD  IN-FILE.
000150 01  IN-REC.
000160     05  EMPLOYEE-NAME-IN            PIC X(20).
000170     05  HOURS-WORKED-IN             PIC 9(2).
000180     05  HOURLY-RATE-IN              PIC 9V99.
000190 FD  OUT-FILE.
000200 01  OUT-REC.
000210     05  FILLER                      PIC X(20).
000220     05  NAME-OUT                    PIC X(20).
000230     05  FILLER                      PIC X(10).
000240     05  HOURS-OUT                   PIC 9(2).
000250     05  FILLER                      PIC X(8).
000260     05  RATE-OUT                    PIC 9.99.
000270     05  FILLER                      PIC X(6).
000280     05  WEEKLY-WAGES-OUT            PIC 999.99.
000290 WORKING-STORAGE SECTION.
000300 01  ARE-THERE-MORE-RECORDS          PICTURE XXX VALUE "YES".
000310 PROCEDURE DIVISION.
000320 100-MAIN-MODULE.
000330     OPEN INPUT IN-FILE
000340          OUTPUT OUT-FILE.
000350     READ IN-FILE
000360         AT END MOVE "NO" TO ARE-THERE-MORE-RECORDS.
000370     PERFORM 200-WAGE-ROUTINE
000380         UNTIL ARE-THERE-MORE-RECORDS = "NO".
000390     CLOSE IN-FILE, OUT-FILE.
000400     DISPLAY "DONE PROCESSING, CHECK OUTFILE".
000410     STOP RUN.
000420 200-WAGE-ROUTINE.
000430     MOVE SPACES TO OUT-REC.
000440     MOVE EMPLOYEE-NAME-IN TO NAME-OUT.
000450     MOVE HOURS-WORKED-IN TO HOURS-OUT.
000460     MOVE HOURLY-RATE-IN TO RATE-OUT.
000470     MULTIPLY HOURS-WORKED-IN BY HOURLY-RATE-IN
000480         GIVING WEEKLY-WAGES-OUT.
000490     WRITE OUT-REC AFTER ADVANCING 2 LINES.
000500     READ IN-FILE
000510         AT END MOVE "NO" TO ARE-THERE-MORE-RECORDS.
