       IDENTIFICATION DIVISION.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       01 COUNTIN          PIC 9999 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY "ENTER LIMIT".
       ACCEPT COUNTIN.
       DISPLAY "I AM OUTSIDE OF THE LOOP".
       PERFORM TRY-IT UNTIL COUNTIN > 5.
       DISPLAY "I am in the loop".
       STOP RUN.
       TRY-IT.
           COMPUTE COUNTIN = COUNTIN + 1.
           DISPLAY COUNTIN.
